public class Main {
    public static void main(String[] args) {
        /*
        — Создать класс УчебнаяГруппа, содержащий в себе поля
        Преподаватель и список Студентов;
        — Создать класс УчебнаяГруппаСервис, в котором реализована функция
        (входные параметры - (Teacher, List<Strudent>))
        формирования из Студентов и Преподавателя УчебнойГруппы и возвращения его;
        — Создать метод в Контроллере, в котором агрегируются функции
        получения списка студентов (их id) и преподавателя (его id) и
        формирования учебной группы, путём вызова метода из сервиса;
        — Всё вышеуказанное создать согласно принципам ООП, пройдённым на семинаре.
        Формат сдачи: ссылка на гитхаб проект
         */
    }
}