package seminars.five;

public class Main {

    /*
    Задание No5
    Нужно написать сквозной тест с использованием Selenium,
    который авторизует пользователя на сайте https://www.saucedemo.com/.
    Данные для входа - логин: "standard_user", пароль: "secret_sauce".
    Проверить, что авторизация прошла успешно и отображаются товары.
    Вам необходимо использовать WebDriver для открытия страницы и методы sendKeys()
    для ввода данных в поля формы, и submit() для отправки формы.
    После этого, проверьте, что на странице отображаются продукты (productsLabel.getText() = "Products").
     */
}
