import java.util.ArrayList;
import java.util.Collections;
import java.util.HashMap;
import java.util.Map;

public class Task1 {
    public static void main(String[] args) {
       /*
       Реализуйте структуру телефонной книги с помощью HashMap,
       учитывая, что 1 человек может иметь несколько телефонов.
        */
//        Map<Integer, String> phoneBook = new HashMap<>();
//        phoneBook.putIfAbsent(79882, "Денис");
//        phoneBook.put(20972, "Саша");
//        phoneBook.put(23241, "Арина");
//        phoneBook.putIfAbsent(29342, "Денис");
//        System.out.println(phoneBook);
//        for (int k:phoneBook){
//            if(k == )
//        }
// попробовать организовать свой класс, внутрь него поместить поле стринг, добавить несколько методов
// добавляет, ищет и показывает
        Map<String, ArrayList<String>> phoneBook2 = new HashMap<>();
//
//        phoneBook2.put("Саша", new ArrayList(Collections.singleton("8345")),
//               Collections.singleton("987"));
//        phoneBook2.put("Арина", new ArrayList<>(new String("79"),
//            new ArrayList<>("575"));
//        phoneBook2.putIfAbsent("Денис", '9657');

    }
}